{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 51], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [17, 3]}, "name": "reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem", "inbound_nodes": [["reshape", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": 2, "step": null}]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.gather", "trainable": true, "dtype": "float32", "function": "compat.v1.gather"}, "name": "tf.compat.v1.gather", "inbound_nodes": [["tf.__operators__.getitem", 0, 0, {"indices": 11, "validate_indices": null, "name": null, "axis": 1, "batch_dims": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.gather_1", "trainable": true, "dtype": "float32", "function": "compat.v1.gather"}, "name": "tf.compat.v1.gather_1", "inbound_nodes": [["tf.__operators__.getitem", 0, 0, {"indices": 12, "validate_indices": null, "name": null, "axis": 1, "batch_dims": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply", "inbound_nodes": [["tf.compat.v1.gather", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_1", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_1", "inbound_nodes": [["tf.compat.v1.gather_1", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add", "inbound_nodes": [["tf.math.multiply", 0, 0, {"y": ["tf.math.multiply_1", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.size", "trainable": true, "dtype": "float32", "function": "compat.v1.size"}, "name": "tf.compat.v1.size", "inbound_nodes": [["tf.__operators__.getitem", 0, 0, {"name": null, "out_type": "int32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims", "inbound_nodes": [["tf.__operators__.add", 0, 0, {"axis": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.floor_div", "trainable": true, "dtype": "float32", "function": "compat.v1.floor_div"}, "name": "tf.compat.v1.floor_div", "inbound_nodes": [["tf.compat.v1.size", 0, 0, {"y": 34, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.broadcast_to", "trainable": true, "dtype": "float32", "function": "broadcast_to"}, "name": "tf.broadcast_to", "inbound_nodes": [["tf.expand_dims", 0, 0, {"shape": [["tf.compat.v1.floor_div", 0, 0], 17, 2], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract", "inbound_nodes": [["tf.__operators__.getitem", 0, 0, {"y": ["tf.broadcast_to", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.gather_6", "trainable": true, "dtype": "float32", "function": "compat.v1.gather"}, "name": "tf.compat.v1.gather_6", "inbound_nodes": [["tf.math.subtract", 0, 0, {"indices": 11, "validate_indices": null, "name": null, "axis": 1, "batch_dims": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.gather_7", "trainable": true, "dtype": "float32", "function": "compat.v1.gather"}, "name": "tf.compat.v1.gather_7", "inbound_nodes": [["tf.math.subtract", 0, 0, {"indices": 12, "validate_indices": null, "name": null, "axis": 1, "batch_dims": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_6", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_6", "inbound_nodes": [["tf.compat.v1.gather_6", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_7", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_7", "inbound_nodes": [["tf.compat.v1.gather_7", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_3", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_3", "inbound_nodes": [["tf.math.multiply_6", 0, 0, {"y": ["tf.math.multiply_7", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.size_1", "trainable": true, "dtype": "float32", "function": "compat.v1.size"}, "name": "tf.compat.v1.size_1", "inbound_nodes": [["tf.math.subtract", 0, 0, {"name": null, "out_type": "int32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.gather_4", "trainable": true, "dtype": "float32", "function": "compat.v1.gather"}, "name": "tf.compat.v1.gather_4", "inbound_nodes": [["tf.math.subtract", 0, 0, {"indices": 5, "validate_indices": null, "name": null, "axis": 1, "batch_dims": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.gather_5", "trainable": true, "dtype": "float32", "function": "compat.v1.gather"}, "name": "tf.compat.v1.gather_5", "inbound_nodes": [["tf.math.subtract", 0, 0, {"indices": 6, "validate_indices": null, "name": null, "axis": 1, "batch_dims": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.gather_2", "trainable": true, "dtype": "float32", "function": "compat.v1.gather"}, "name": "tf.compat.v1.gather_2", "inbound_nodes": [["tf.math.subtract", 0, 0, {"indices": 11, "validate_indices": null, "name": null, "axis": 1, "batch_dims": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.gather_3", "trainable": true, "dtype": "float32", "function": "compat.v1.gather"}, "name": "tf.compat.v1.gather_3", "inbound_nodes": [["tf.math.subtract", 0, 0, {"indices": 12, "validate_indices": null, "name": null, "axis": 1, "batch_dims": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims_1", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims_1", "inbound_nodes": [["tf.__operators__.add_3", 0, 0, {"axis": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.floor_div_1", "trainable": true, "dtype": "float32", "function": "compat.v1.floor_div"}, "name": "tf.compat.v1.floor_div_1", "inbound_nodes": [["tf.compat.v1.size_1", 0, 0, {"y": 34, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_4", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_4", "inbound_nodes": [["tf.compat.v1.gather_4", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_5", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_5", "inbound_nodes": [["tf.compat.v1.gather_5", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_2", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_2", "inbound_nodes": [["tf.compat.v1.gather_2", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_3", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_3", "inbound_nodes": [["tf.compat.v1.gather_3", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.broadcast_to_1", "trainable": true, "dtype": "float32", "function": "broadcast_to"}, "name": "tf.broadcast_to_1", "inbound_nodes": [["tf.expand_dims_1", 0, 0, {"shape": [["tf.compat.v1.floor_div_1", 0, 0], 17, 2], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_2", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_2", "inbound_nodes": [["tf.math.multiply_4", 0, 0, {"y": ["tf.math.multiply_5", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_1", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_1", "inbound_nodes": [["tf.math.multiply_2", 0, 0, {"y": ["tf.math.multiply_3", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_2", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_2", "inbound_nodes": [["tf.math.subtract", 0, 0, {"y": ["tf.broadcast_to_1", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_1", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_1", "inbound_nodes": [["tf.__operators__.add_2", 0, 0, {"y": ["tf.__operators__.add_1", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.gather_8", "trainable": true, "dtype": "float32", "function": "compat.v1.gather"}, "name": "tf.compat.v1.gather_8", "inbound_nodes": [["tf.math.subtract_2", 0, 0, {"indices": 0, "validate_indices": null, "name": "dist_to_pose_center", "axis": 0, "batch_dims": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.norm", "trainable": true, "dtype": "float32", "function": "compat.v1.norm"}, "name": "tf.compat.v1.norm", "inbound_nodes": [["tf.math.subtract_1", 0, 0, {"ord": "euclidean", "axis": null, "keepdims": null, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.norm_1", "trainable": true, "dtype": "float32", "function": "compat.v1.norm"}, "name": "tf.compat.v1.norm_1", "inbound_nodes": [["tf.compat.v1.gather_8", 0, 0, {"ord": "euclidean", "axis": 0, "keepdims": null, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_8", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_8", "inbound_nodes": [["tf.compat.v1.norm", 0, 0, {"y": 2.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_max", "trainable": true, "dtype": "float32", "function": "math.reduce_max"}, "name": "tf.math.reduce_max", "inbound_nodes": [["tf.compat.v1.norm_1", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.maximum", "trainable": true, "dtype": "float32", "function": "math.maximum"}, "name": "tf.math.maximum", "inbound_nodes": [["tf.math.multiply_8", 0, 0, {"y": ["tf.math.reduce_max", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.truediv", "trainable": true, "dtype": "float32", "function": "math.truediv"}, "name": "tf.math.truediv", "inbound_nodes": [["tf.math.subtract", 0, 0, {"y": ["tf.math.maximum", 0, 0], "name": null}]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["tf.math.truediv", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu6", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu6", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [34, 128], "dtype": "float32"}, {"name": "dense/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [64, 5], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [5], "dtype": "float32"}]}]}